# References

## Data Source

https://www.kaggle.com/datasets/jihyeseo/online-retail-data-set-from-uci-ml-repo

# Cleaning and Segmenting

In [1]:
# importing packages
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from mpl_toolkits import mplot3d
sns.set_style('darkgrid')
from sklearn.metrics import silhouette_score
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
import warnings
warnings.filterwarnings('ignore')

In [2]:
# loading retail data
df = pd.read_excel('C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/Online Retail.xlsx')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [3]:
df.duplicated().sum()

5268

In [4]:
# removing duplicates
df = df[~df.duplicated()]
df.shape

(536641, 8)

In [5]:
# removing all the invoice number who starts with 'C' as they are returned orders
df = df[df['InvoiceNo'].str.startswith('C')!=True]
df.shape

(527390, 8)

In [6]:
# keeping only those transactions that have successfully ordered
df = df[df['Quantity']>=0]
df.shape

(526054, 8)

In [7]:
# putting UK as one country and combine rest countries into one category
df['Country'] = df['Country'].apply(lambda x:'United Kingdom' if x=='United Kingdom' else 'Others')
df.Country.value_counts(normalize=True)

United Kingdom    0.914627
Others            0.085373
Name: Country, dtype: float64

In [8]:
# removing all the above entries
df = df[df['Description'].str.startswith('?')!=True]
df.shape

(526048, 8)

In [9]:
# checking the data where description = * and it is noted that customerid is NaN
df[df['Description'].str.startswith('*')==True]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
20749,538071,21120,*Boombox Ipod Classic,1,2010-12-09 14:09:00,16.98,NaN,United Kingdom
35675,539437,20954,*USB Office Mirror Ball,1,2010-12-17 14:54:00,8.47,NaN,United Kingdom
37095,539453,20954,*USB Office Mirror Ball,1,2010-12-17 17:08:00,8.47,NaN,United Kingdom

In [10]:
# replacing with appropriate name
df['Description'] = df['Description'].replace(('*Boombox Ipod Classic','*USB Office Mirror Ball'),
                                             ('BOOMBOX IPOD CLASSIC','USB OFFICE MIRROR BALL'))

In [11]:
# Description have actual entries in uppercase words and those who don't have are some of the noises in the dataset
df[df['Description'].str.islower()==True]['Description'].value_counts()

check                                  39
found                                  25
adjustment                             14
amazon                                  8
had been put aside                      5
dotcom                                  4
mailout                                 3
test                                    2
taig adjust                             2
returned                                2
check?                                  1
website fixed                           1
amazon sales                            1
damaged                                 1
mailout                                 1
found box                               1
did  a credit  and did not tick ret     1
wrongly marked 23343                    1
for online retail orders                1
alan hodge cant mamage this section     1
dotcomstock                             1
to push order througha s stock was      1
wrongly coded 23343                     1
on cargo order                          1
wrongly coded 20713                     1
add stock to allocate online orders     1
wrongly marked                          1
wrongly sold (22719) barcode            1
michel oops                             1
rcvd be air temp fix for dotcom sit     1
allocate stock for dotcom orders ta     1
amazon adjust                           1
dotcom adjust                           1
came coded as 20713                     1
Name: Description, dtype: int64

In [12]:
# removing all the above noises
df = df[df['Description'].str.islower()!=True]
df.shape

(525920, 8)

In [13]:
# Description have actual entries in uppercase words and those who don't have are some of the noises in the dataset
df[df['Description'].str.istitle()==True]['Description'].value_counts()

Manual                                 323
Next Day Carriage                       79
Bank Charges                            12
Dotcomgiftshop Gift Voucher £20.00       9
Dotcomgiftshop Gift Voucher £10.00       8
Found                                    8
Dotcomgiftshop Gift Voucher £30.00       7
Amazon                                   7
Dotcomgiftshop Gift Voucher £50.00       4
High Resolution Image                    3
Dotcomgiftshop Gift Voucher £40.00       3
Adjustment                               2
John Lewis                               1
Amazon Adjustment                        1
Dotcomgiftshop Gift Voucher £100.00      1
Name: Description, dtype: int64

In [14]:
# removing all the above listed noises
df = df[df['Description'].str.istitle()!=True]
df.shape

(525452, 8)

In [15]:
df['Description'] = df['Description'].str.strip()

In [16]:
# removing entries where customer id is null
df = df[~df.CustomerID.isnull()]
df.shape

(392353, 8)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392353 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    392353 non-null  object
 1   StockCode    392353 non-null  object
 2   Description  392353 non-null  object
 3   Quantity     392353 non-null  int64
 4   InvoiceDate  392353 non-null  datetime64[ns]
 5   UnitPrice    392353 non-null  float64
 6   CustomerID   392353 non-null  float64
 7   Country      392353 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 26.9+ MB

In [18]:
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [19]:
# checking random 5 rows from data
df.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
380019,569724,21500,PINK POLKADOT WRAP,50,2011-10-06 09:35:00,0.36,15061.0,United Kingdom
257385,559526,79321,CHILLI LIGHTS,1,2011-07-10 11:19:00,5.75,15756.0,United Kingdom
406975,571841,22367,CHILDRENS APRON SPACEBOY DESIGN,3,2011-10-19 12:21:00,1.95,17625.0,United Kingdom
437412,574290,22557,PLASTERS IN TIN VINTAGE PAISLEY,1,2011-11-03 15:18:00,1.65,17403.0,United Kingdom
369811,569103,22625,RED KITCHEN SCALES,2,2011-09-30 12:30:00,8.50,16133.0,United Kingdom

# Creating Intermediate Variables

In [20]:
# creating some columns for exploratory
df['Amount'] = df['Quantity']*df['UnitPrice']

In [21]:
df.shape

(392353, 9)

In [22]:
# getting the data from timestamp
df_c = df.copy()
df_c['date'] = df_c['InvoiceDate'].dt.strftime('%Y-%m-%d')
df_c.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01

# Segmenting data based on dates

## Transactions of 2010-12-01

In [23]:
# segmenting the transaction for the date '2010-12-01'
df_2010_12_01 = df_c.loc[df_c['date'] == '2010-12-01']
df_2010_12_01.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01

In [24]:
df_2010_12_01.shape

(1896, 10)

In [25]:
# slicing the 2010-12-01 transactions for necessary features
df_2010_12_01_final = df_2010_12_01[['CustomerID','date','Quantity','UnitPrice','Amount']]
df_2010_12_01_final.head()

   CustomerID        date  Quantity  UnitPrice  Amount
0     17850.0  2010-12-01         6       2.55   15.30
1     17850.0  2010-12-01         6       3.39   20.34
2     17850.0  2010-12-01         8       2.75   22.00
3     17850.0  2010-12-01         6       3.39   20.34
4     17850.0  2010-12-01         6       3.39   20.34

In [26]:
# creating frequency column - number of item a customer purchased 
df_2010_12_01_f = pd.DataFrame(df_2010_12_01_final.groupby(['CustomerID'])['date'].count().reset_index())
df_2010_12_01_f.columns = ['CustomerID','frequency']
df_2010_12_01_f.tail()

    CustomerID  frequency
90     18011.0         28
91     18074.0         13
92     18085.0          9
93     18144.0          3
94     18229.0          7

In [27]:
# grouping the data based o customerID
df_2010_12_01_m = pd.DataFrame(df_2010_12_01_final.groupby(['CustomerID'])[['Amount','Quantity','UnitPrice']].sum().reset_index())
df_2010_12_01_m.head()

   CustomerID   Amount  Quantity  UnitPrice
0     12431.0   358.25       107      73.90
1     12433.0  1919.14      1852     102.67
2     12583.0   855.86       449      55.29
3     12662.0   261.48       157      44.37
4     12748.0     4.95         1       4.95

In [28]:
print(df_2010_12_01_m.shape, df_2010_12_01_f.shape)

(95, 4) (95, 2)

In [29]:
# merging frequency and monetary tables to final table
df_2010_12_01_fm = pd.merge(df_2010_12_01_m, df_2010_12_01_f, on='CustomerID',how='inner')
df_2010_12_01_fm.head()

   CustomerID   Amount  Quantity  UnitPrice  frequency
0     12431.0   358.25       107      73.90         14
1     12433.0  1919.14      1852     102.67         73
2     12583.0   855.86       449      55.29         20
3     12662.0   261.48       157      44.37         15
4     12748.0     4.95         1       4.95          1

In [30]:
df_2010_12_01_fm.shape

(95, 5)

In [31]:
df_2010_12_01_fm.isnull().sum()

CustomerID    0
Amount        0
Quantity      0
UnitPrice     0
frequency     0
dtype: int64

## Transactions of 2010-12-02

In [32]:
# segmenting the transaction for the date '2010-12-02'
df_2010_12_02 = df_c.loc[df_c['date'] == '2010-12-02']
df_2010_12_02.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
3108,536598,21421,PORCELAIN ROSE LARGE,12,2010-12-02 07:48:00,1.25,13090.0,United Kingdom,15.0,2010-12-02
3109,536598,21422,PORCELAIN ROSE SMALL,16,2010-12-02 07:48:00,0.85,13090.0,United Kingdom,13.6,2010-12-02
3110,536598,22178,VICTORIAN GLASS HANGING T-LIGHT,24,2010-12-02 07:48:00,1.25,13090.0,United Kingdom,30.0,2010-12-02
3111,536598,22617,BAKING SET SPACEBOY DESIGN,24,2010-12-02 07:48:00,4.25,13090.0,United Kingdom,102.0,2010-12-02
3112,536599,22968,ROSE COTTAGE KEEPSAKE BOX,8,2010-12-02 07:49:00,8.50,15694.0,United Kingdom,68.0,2010-12-02

In [33]:
# slicing the 2010-12-02 transactions for necessary features
df_2010_12_02_final = df_2010_12_02[['CustomerID','date','Quantity','UnitPrice','Amount']]
df_2010_12_02_final.head()

      CustomerID        date  Quantity  UnitPrice  Amount
3108     13090.0  2010-12-02        12       1.25    15.0
3109     13090.0  2010-12-02        16       0.85    13.6
3110     13090.0  2010-12-02        24       1.25    30.0
3111     13090.0  2010-12-02        24       4.25   102.0
3112     15694.0  2010-12-02         8       8.50    68.0

In [34]:
df_2010_12_02_final.shape

(1958, 5)

In [35]:
# creating frequency column - number of item a customer purchased 
df_2010_12_02_f = pd.DataFrame(df_2010_12_02_final.groupby(['CustomerID'])['date'].count().reset_index())
df_2010_12_02_f.columns = ['CustomerID','frequency']
df_2010_12_02_f.tail()

    CustomerID  frequency
93     17964.0         35
94     17976.0         57
95     18041.0         73
96     18168.0         27
97     18239.0         29

In [36]:
# grouping the data based o customerID
df_2010_12_02_m = pd.DataFrame(df_2010_12_02_final.groupby(['CustomerID'])[['Amount','Quantity','UnitPrice']].sum().reset_index())
df_2010_12_02_m.head()

   CustomerID  Amount  Quantity  UnitPrice
0     12738.0  155.35       148      43.45
1     12748.0    4.25         1       4.25
2     12855.0   38.10        30       4.65
3     12915.0  199.65        41     100.00
4     12971.0   45.12        84       2.92

In [37]:
# merging frequency and monetary tables to final table
df_2010_12_02_fm = pd.merge(df_2010_12_02_m, df_2010_12_02_f, on='CustomerID',how='inner')
df_2010_12_02_fm.head()

   CustomerID  Amount  Quantity  UnitPrice  frequency
0     12738.0  155.35       148      43.45         11
1     12748.0    4.25         1       4.25          1
2     12855.0   38.10        30       4.65          3
3     12915.0  199.65        41     100.00         13
4     12971.0   45.12        84       2.92          5

In [38]:
df_2010_12_02_fm.shape

(98, 5)

In [39]:
df_2010_12_02_fm.isnull().sum()

CustomerID    0
Amount        0
Quantity      0
UnitPrice     0
frequency     0
dtype: int64

# Saving transaction segments

In [40]:
df_2010_12_01_fm.head()

   CustomerID   Amount  Quantity  UnitPrice  frequency
0     12431.0   358.25       107      73.90         14
1     12433.0  1919.14      1852     102.67         73
2     12583.0   855.86       449      55.29         20
3     12662.0   261.48       157      44.37         15
4     12748.0     4.95         1       4.95          1

In [41]:
df_2010_12_01_fm = df_2010_12_01_fm.drop('UnitPrice', 1)

In [42]:
df_2010_12_01_fm.shape

(95, 4)

In [43]:
# saving 2010-12-01 customers data
df_2010_12_01_fm.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_01_fm.csv', index=False)

In [44]:
df_2010_12_02_fm.head()

   CustomerID  Amount  Quantity  UnitPrice  frequency
0     12738.0  155.35       148      43.45         11
1     12748.0    4.25         1       4.25          1
2     12855.0   38.10        30       4.65          3
3     12915.0  199.65        41     100.00         13
4     12971.0   45.12        84       2.92          5

In [45]:
df_2010_12_02_fm = df_2010_12_02_fm.drop('UnitPrice', 1)

In [46]:
df_2010_12_02_fm.shape

(98, 4)

In [47]:
# saving 2010-12-02 customers data
df_2010_12_02_fm.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_02_fm.csv', index=False)

# Modeling

In [48]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score

## for 2010-12-01

In [49]:
df_1 = df_2010_12_01_fm

In [50]:
# seperating target and input
X_1 = df_1[['Quantity','frequency']]
y_1 = df_1[['Amount']]

In [51]:
# test and train split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X_1, y_1, test_size=0.3)
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(66, 2) (29, 2) (66, 1) (29, 1)

In [52]:
# creating model object
regressor = LinearRegression()  
regressor.fit(X_train, y_train)

LinearRegression()

In [53]:
#To retrieve the intercept:
print(regressor.intercept_)

#For retrieving the slope:
print(regressor.coef_)

[90.5922291]
[[ 1.61830795 -1.25176912]]

In [54]:
# predictions for test data
y_pred = regressor.predict(X_test)
y_test_arr = np.array(y_test)

In [55]:
# converting the test data prediction and other important features into a dataframe
df_test = pd.DataFrame({'Quantity':np.array(X_test['Quantity']).flatten(), 'frequency':np.array(X_test['frequency']).flatten(),'Actual_amt': y_test_arr.flatten(), 'Predicted_amt': y_pred.flatten()})

In [56]:
df_test.shape

(29, 4)

In [57]:
# train data predictions
y_train_pred = regressor.predict(X_train)

In [58]:
# converting the train data prediction and other important features into a dataframe
df_train = pd.DataFrame({'Quantity':np.array(X_train['Quantity']).flatten(), 'frequency':np.array(X_train['frequency']).flatten(),'Actual_amt': np.array(y_train['Amount']).flatten(), 'Predicted_amt': y_train_pred.flatten()})

In [59]:
df_train.shape

(66, 4)

In [60]:
# combinig test and train data prediction tables into one final table
df_1_pred = df_train.append(df_test)
df_1_pred.shape

(95, 4)

In [61]:
df_1_pred['Predicted_amt'] = df_1_pred['Predicted_amt'].apply(abs)
df_1_pred.shape

(95, 4)

In [62]:
(df_1_pred < 0).values.any()

False

In [63]:
# saving prediction results for date 2010-12-01
df_1_pred.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_01_pred.csv', index=False)

### Model Metrics

In [70]:
from sklearn.metrics import mean_squared_error
mse_test_1 = mean_squared_error(np.absolute(y_pred), y_test)
mse_test_1

78952.57671731287

In [72]:
mse_train_1 = mean_squared_error(np.absolute(y_train_pred), y_train)
mse_train_1

67715.89927366073

In [77]:
from sklearn.metrics import r2_score 
r2_pred = r2_score(y_test, y_pred)
r2_pred

0.8643709851045258

In [78]:
r2_train = r2_score(y_train, y_train_pred)
r2_train

0.9019497847574547

In [98]:
values_01 = [['test','mse',mse_test_1],
             ['train','mse',mse_train_1],
             ['test','r2',r2_pred],
             ['train','r2',r2_train]]

In [99]:
df_metric_01 = pd.DataFrame(values_01, columns = ['data_split', 'metric', 'value'])
df_metric_01

  data_split metric         value
0       test    mse  78952.576717
1      train    mse  67715.899274
2       test     r2      0.864371
3      train     r2      0.901950

In [100]:
# saving prediction results for date 2010-12-01
df_metric_01.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_01_metric.csv', index=False)

## for 2010-12-02

In [81]:
df_2 = df_2010_12_02_fm

In [82]:
# seperating target and input
X_2 = df_2[['Quantity','frequency']]
y_2 = df_2[['Amount']]

In [83]:
# test and train split
X_train, X_test, y_train, y_test = train_test_split(X_2, y_2, test_size=0.3)
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(68, 2) (30, 2) (68, 1) (30, 1)

In [84]:
# creating model object
regressor = LinearRegression()  
regressor.fit(X_train, y_train)

LinearRegression()

In [85]:
#To retrieve the intercept:
print(regressor.intercept_)

#For retrieving the slope:
print(regressor.coef_)

[-95.20190497]
[[1.4968939  7.62954086]]

In [86]:
# test data predictions
y_pred = regressor.predict(X_test)
y_test_arr = np.array(y_test)

In [87]:
# converting the test data prediction and other important features into a dataframe
df_test = pd.DataFrame({'Quantity':np.array(X_test['Quantity']).flatten(), 'frequency':np.array(X_test['frequency']).flatten(),'Actual_amt': y_test_arr.flatten(), 'Predicted_amt': y_pred.flatten()})

In [88]:
# train data predictions
y_train_pred = regressor.predict(X_train)

In [89]:
# converting the train data prediction and other important features into a dataframe
df_train = pd.DataFrame({'Quantity':np.array(X_train['Quantity']).flatten(), 'frequency':np.array(X_train['frequency']).flatten(),'Actual_amt': np.array(y_train['Amount']).flatten(), 'Predicted_amt': y_train_pred.flatten()})

In [90]:
# combinig test and train data prediction tables into one final table
df_2_pred = df_train.append(df_test)
df_2_pred.shape

(98, 4)

In [91]:
df_2_pred['Predicted_amt'] = df_2_pred['Predicted_amt'].apply(abs)
df_2_pred.shape

(98, 4)

In [92]:
(df_2_pred < 0).values.any()

False

In [93]:
# saving prediction results for date 2010-12-02
df_2_pred.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_02_pred.csv', index=False)

### Model Metrics

In [94]:
from sklearn.metrics import mean_squared_error
mse_test_2 = mean_squared_error(np.absolute(y_pred), y_test)
mse_test_2

660851.4518471223

In [95]:
mse_train_2 = mean_squared_error(np.absolute(y_train_pred), y_train)
mse_train_2

94481.05810148093

In [96]:
from sklearn.metrics import r2_score 
r2_pred_2 = r2_score(y_test, y_pred)
r2_pred_2

-4.0310346227520695

In [97]:
r2_train_2 = r2_score(y_train, y_train_pred)
r2_train_2

0.9337858373257641

In [101]:
values_02 = [['test','mse',mse_test_2],
             ['train','mse',mse_train_2],
             ['test','r2',r2_pred_2],
             ['train','r2',r2_train_2]]

In [102]:
df_metric_02 = pd.DataFrame(values_02, columns = ['data_split', 'metric', 'value'])
df_metric_02

  data_split metric          value
0       test    mse  660851.451847
1      train    mse   94481.058101
2       test     r2      -4.031035
3      train     r2       0.933786

In [103]:
# saving prediction results for date 2010-12-02
df_metric_02.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_02_metric.csv', index=False)